{
  "titles": [
    "About Me",
    "Contacts",
    "Skills",
    "Language",
    "Education",
    "My projects"
  ],
  "about": [
    "My name is Nadzeya Stashkevich. I am a Junior Frontend developer. I completed courses at Rolling Scopes School (EPAM) and have practical skills in web page layout, creating the Frontend part of websites using JavaScript/TypeScript, Angular and React. I have experience with Webpack and npm. I have worked in both individual and team development using the git version control system. I continue to improve my skills and plan to become an experienced web developer.",
    "Nadzeya Stashkevich",
    "Frontend developer"
  ],
  "languages": ["Russian", "native language", "English"],
  "education": {
    "titles": [
      "Online courses, Stepik.org",
      "Rolling Scopes School, Pre-School (Stage#0)",
      "Rolling Scopes School, JS/Frontend course (Stage#1-2)",
      "Rolling Scopes School, Angular course (Stage#3)"
    ],
    "dates": [
      "DEC 2021 - MAY 2022",
      "JUN 2022 - SEP 2022",
      "SEP 2022 - FEB 2023",
      "MAR 2023 - MAY 2023"
    ],
    "descriptions": [
      "Web page layout using HTML and CSS based on Figma designs. SCSS and SASS preprocessors. Responsive web design, multimedia. Bootstrap library. Setting up VS Code plugins. Using DevTools. Basics of JS.",
      "Markdown. Working with Git, GitHub. Chrome Dev Tools and VS Code. CSS Flexbox. Solving tasks on Codewars. JS data types, algorithms, loops. Working with the DOM. Basics of Webpack. NodeJS, NPM. Creating projects using JS and Webpack.",
      "Git, GitHub. Responsive design, media queries, CSS Flexbox, SCSS. Algorithmic tasks, functions, scope. Working with Figma. HTML forms, DOM, DOM events. Modules in JS, Webpack. Server interaction. OOP, classes. Codewars. Mentorship interviews. Working with TypeScript, ESLint. Developing user interface components, creating team projects.",
      "Creating an Angular project, adding ESLint, project structure. Angular components, directives, and pipes. Modules, routing. Services. Forms. RxJS, Observable, Subject. NgRx, Store. Using Material UI and PrimeNG components. Creating the team project."
    ],
    "links": "certificate"
  },
  "projects": [
    "travel planning website",
    "Chrome browser widget, similar to the corresponding application",
    "website with information about animals from various zoos",
    "analog of the classic game «Fifteen Puzzle»",
    "quiz application for bird recognition based on their sounds",
    "E-commerce website, team project",
    "task management application, team project",
    "client application using the YouTube API"
  ]
}
