{
  "title": {
    "aboutTitle": "Обо мне",
    "contactsTitle": "Контакты",
    "skillsTitle": "Навыки",
    "languageTitle": "Язык",
    "educationTitle": "Образование",
    "projectsTitle": "Мои работы"
  },
  "aboutMe": "Меня зовут Надежда Сташкевич. Я родилась в городе Минске в 1994 году. В 2011 году получила школьное образование, затем поступила в медицинский университет. После окончания университета работала детским врачом. В 2021 году я решила сменить специализацию и стать веб-разработчиком, начала самостоятельно изучать технологии создания веб-страниц и приложений.",
  "languages": {
    "ru": "Русский",
    "ruDescr": " - родной язык",
    "en": "Английский"
  },
  "name": "Надежда Сташкевич",
  "profession": "Web-разработчик",
  "education": [
    {
      "educationTitle": "Видеоуроки на YouTube, онлайн-курсы на Stepik.org",
      "educationDate": "ДЕК 2021 - МАЙ 2022",
      "educationText": "Верстка веб-страниц на HTML и CSS по макетам Figma. Препроцессоры SCSS и SASS. Адаптивный веб-дизайн, мультимедиа. Библиотека Bootstrap. Настройка плагинов VS Code. Пользование DevTools. Основы JS."
    },
    {
      "educationTitle": "Rolling Scopes School, подготовительный курс (этап#0)",
      "educationDate": "ИЮН 2022 - СЕНТ 2022",
      "educationText": "RS School, подготовительный курс JS/Frontend. Этап #0: Markdown. Работа с Git, GitHub. Chrome Dev Tools и VS Code. CSS Flex. Решение задач на Codewars. Типы данных JS, алгоритмы, циклы. Работа с DOM. Основы Webpack. NodeJS, NPM. Создание проектов на JS и Webpack."
    },
    {
      "educationTitle": "Rolling Scopes School, курс JS/Frontend (этап#1-2)",
      "educationDate": "СЕНТ 2022 - ФЕВ 2023",
      "educationText": "RS School, курс JS/Frontend. Этапы #1-2: Git, GitHub. Адаптивный дизайн, медиазапросы, CSS Flex, SCSS. Алгоритмические задачи, функции, Scope. Работа с Figma. HTML формы, DOM, DOM события. Модули в JS, WebPack. Взаимодействие с сервером. ООП, классы. Codewars. Собеседования с менторами. Работа c TypeScript, ESLint. Разработка компонентов пользовательского интерфейса, создание командных проектов."
    }
  ],
  "projects": {
    "TravelPortal": "сайт для планирования путешествий",
    "Momentum": "виджет для браузера Chrome, аналог одноименного приложения",
    "OnlineZoo": "сайт с информацией о животных из различных зоопарков",
    "GemPuzzle": "аналог классической игры «Пятнашки»",
    "Songbird": "приложение-викторина для распознавания птиц по их голосам",
    "OnlineStore": "сайт интернет-магазина, командный проект",
    "TrelloClone": "аналог одноименного приложения для управления задачами, командный проект"
  }
}
