{
  "titles": [
    "Обо мне",
    "Контакты",
    "Навыки",
    "Язык",
    "Образование",
    "Мои работы"
  ],
  "about": [
    "Меня зовут Надежда Сташкевич. Я Junior Frontend разработчик. Закончила курсы от Rolling Scopes School (EPAM), имею практические навыки верстки веб-страниц, создания Frontend части сайтов на Javascript/TypeScript, Angular. Работала с Webpack и Git. Участвовала как в индивидуальной, так и командной разработке. Продолжаю развивать свои навыки, планирую стать опытным веб-разработчиком.",
    "Надежда Сташкевич",
    "Frontend-разработчик"
  ],
  "languages": ["Русский", "родной язык", "Английский"],
  "education": {
    "titles": [
      "Онлайн-курсы, Stepik.org",
      "Rolling Scopes School, подготовительный курс (этап#0)",
      "Rolling Scopes School, курс JS/Frontend (этап#1-2)",
      "Rolling Scopes School, курс Angular (этап#3)"
    ],
    "dates": [
      "ДЕК 2021 - МАЙ 2022",
      "ИЮН 2022 - СЕНТ 2022",
      "СЕНТ 2022 - ФЕВ 2023",
      "МАРТ 2023 - МАЙ 2023"
    ],
    "descriptions": [
      "Верстка веб-страниц на HTML и CSS по макетам Figma. Препроцессоры SCSS и SASS. Адаптивный веб-дизайн, мультимедиа. Библиотека Bootstrap. Настройка плагинов VS Code. Пользование DevTools. Основы JS.",
      "Markdown. Работа с Git, GitHub. Chrome Dev Tools и VS Code. CSS Flex. Решение задач на Codewars. Типы данных JS, алгоритмы, циклы. Работа с DOM. Основы Webpack. NodeJS, NPM. Создание проектов на JS и Webpack.",
      "Git, GitHub. Адаптивный дизайн, медиазапросы, CSS Flex, SCSS. Алгоритмические задачи, функции, Scope. Работа с Figma. HTML формы, DOM, DOM события. Модули в JS, WebPack. Взаимодействие с сервером. ООП, классы. Codewars. Собеседования с менторами. Работа c TypeScript, ESLint. Разработка компонентов пользовательского интерфейса, создание командных проектов.",
      "Создание проекта Angular, добавление ESLint, структура проекта. Компоненты Angular, директивы и пайпы. Модули, роутинг. Сервисы. Формы. RxJS, Observable, Subject. NgRx, Store. Использование компонентов Material UI, PrimeNG. Создание командного проекта."
    ],
    "links": "сертификат"
  },
  "projects": [
    "сайт для планирования путешествий",
    "виджет для браузера Chrome, аналог одноименного приложения",
    "сайт с информацией о животных из различных зоопарков",
    "аналог классической игры «Пятнашки»",
    "приложение-викторина для распознавания птиц по их голосам",
    "сайт интернет-магазина, командный проект",
    "аналог одноименного приложения для управления задачами, командный проект",
    "сайт для бронирования авиабилетов, командный проект"
  ]
}
